/*======================================================================
	gentable.c
			Copyright 1998, 2001 Igarashi
======================================================================*/
/*======================================================================
　本ファイルの著作権は作者（いがらし）に属しますが、利用者の常識と責任の
範囲において、自由に使用 / 複製 / 配付 / 改造することができます。その際、
許諾を求める必要もなければ、ロイヤリティの類も一切必要ありません。

　本ファイルは無保証です。本ファイルを使用した結果について、作者は一切の
責任を負わないものとします。
======================================================================*/

#include	<stdio.h>
#include	<stdlib.h>
#include	<ctype.h>

int main( int argc, char *argv[] )
{
	int	nshift, i;
	if ( argc != 2 )
		return EXIT_FAILURE;
	switch ( tolower( *argv[1])) {
		case 'r':
			nshift = 6;
			break;
		case 'g':
			nshift = 11;
			break;
		case 'b':
			nshift = 1;
			break;
		default:
			return EXIT_FAILURE;
			break;
	}
	for ( i = 0; i < 256; i++ ) {
		printf( "%s0x%04x%s%s",
					( i % 8 )? "": "\t",
					(( 32 * i ) / 256 ) << nshift,
					((( i + 1 ) % 8 ) || ( i != 255 ))? ", ": "",
					(( i + 1 ) % 8 )? "": "\n" );
	}
	return EXIT_SUCCESS;
}

